src/Catalogs/фуСтруктураОтчётаДДС/фуСтруктураОтчётаДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>фуСтруктураОтчётаДДС</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>КодСтрокиВОтчете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУдалятьСтрокуУровняВОтчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.фуСтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГруппаЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВложенности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/фуСтруктураОтчётаДДС/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
    
    Если Не фуОбщийСервер.ЕстьДетиУСправочника(ЭтотОбъект.Ссылка,"фуСтруктураОтчётаДДС") Тогда
    	ЭтотОбъект.ЭтоГруппаЗаголовок = Ложь;
    КонецЕсли; 

    Если ЭтотОбъект.ЭтоГруппаЗаголовок Тогда
		ЭтотОбъект.СтатьяЗатрат = Справочники.фуСтатьиЗатрат.ПустаяСсылка();	
	КонецЕсли;   
	
	ЭтотОбъект.УровеньВложенности = ЭтотОбъект.Уровень();
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    
    фуОбщийСервер.УстановитьЭтоГруппаУРодителей(ЭтотОбъект.Родитель);

КонецПроцедуры
